<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use PDF;

class PdfController extends Controller
{
    public function viewPdf()
    {
        $data = [
            'details' => 'লারাভেল বাংলা পিডিএফ সামগ্রিকভাবে একটি ওপেন সোর্স ও পপুলার ওয়েব ডেভেলপমেন্ট ফ্রেমওয়ার্ক, যা ওয়েব অ্যাপ্লিকেশন তৈরির জন্য ব্যবহৃত হয়। এই ফ্রেমওয়ার্কটি বাংলা ভাষায় পিডিএফ তৈরির জন্য ব্যবহার করা যেতে পারে। লারাভেল ব্যবহার করে, ডেভেলপাররা বাংলা ভাষায় ডাটা বেস অ্যাপ্লিকেশন, বিশেষভাবে পিডিএফ ফরম্যাটে রিপোর্ট বা ডেটা দেখার জন্য ব্যবহার করতে পারে। লারাভেল বাংলা পিডিএফ ব্যবহার করে ডেভেলপাররা সহজেই বাংলা ভাষায় ডাটা প্রস্তুত করতে পারে এবং সেই ডাটা পিডিএফ ফরম্যাটে রূপান্তরিত করতে পারে। এটি ওয়েব ডেভেলপমেন্ট প্রকল্পে ব্যবহার করার জন্য একটি পূর্ণসম্পূর্ণ এবং কার্যকরী সমাধান হিসেবে প্রস্তুত।'
        ];
        $pdf = PDF::loadView('pdf.document', $data);
        return $pdf->stream('document.pdf');
    }
}
